; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_4 ?v7 - type_2 ?v5 - type_1)
 	      (pred_1 ?v2 - object ?v5 - type_1)
	      (pred_2 ?v7 - type_2 ?v4 - type_3)
	      (pred_3 ?v7 - type_2 ?v2 - object ?v4 - type_3))

   (:action op_2
       :parameters  (?v7 - type_2 ?v8 ?v1 - type_1)
       :precondition (and  (pred_4 ?v7 ?v8))
       :effect (and  (pred_4 ?v7 ?v1)
		     (not (pred_4 ?v7 ?v8))))

   (:action op_1
       :parameters (?v7 - type_2 ?v3 - object ?v6 - type_1 ?v4 - type_3)
       :precondition  (and  (pred_1 ?v3 ?v6) (pred_4 ?v7 ?v6) (pred_2 ?v7 ?v4))
       :effect (and (pred_3 ?v7 ?v3 ?v4)
		    (not (pred_1 ?v3 ?v6)) 
		    (not (pred_2 ?v7 ?v4))))

   (:action op_3
       :parameters (?v7 - type_2 ?v3 - object ?v6 - type_1 ?v4 - type_3)
       :precondition  (and  (pred_3 ?v7 ?v3 ?v4) (pred_4 ?v7 ?v6))
       :effect (and (pred_1 ?v3 ?v6)
		    (pred_2 ?v7 ?v4)
		    (not (pred_3 ?v7 ?v3 ?v4)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_02 obj_05 - type_2
obj_12 obj_01 obj_06 obj_13 - type_3
obj_11 obj_07 obj_04 obj_08 - type_1
obj_10 obj_09 obj_03 - object)
(:init
(pred_4 obj_02 obj_07)
(pred_2 obj_02 obj_12)
(pred_2 obj_02 obj_01)
(pred_4 obj_05 obj_11)
(pred_2 obj_05 obj_06)
(pred_2 obj_05 obj_13)
(pred_1 obj_10 obj_04)
(pred_1 obj_09 obj_08)
(pred_1 obj_03 obj_11)
)
(:goal
(and
(pred_1 obj_10 obj_08)
(pred_1 obj_09 obj_08)
(pred_1 obj_03 obj_11)
)
)

(:constraints
  (and
    (always (not (and (pred_4 obj_02 obj_08) (pred_4 obj_05 obj_08))))
  )
)
)

; plan
1. (op_2 obj_02 obj_07 obj_11)
   deleted: (pred_4 obj_02 obj_07)
   added: (pred_4 obj_02 obj_11)
   goals met: 2 of 3
2. (op_2 obj_05 obj_11 obj_04)
   deleted: (pred_4 obj_05 obj_11)
   added: (pred_4 obj_05 obj_04)
   goals met: 2 of 3
3. (op_1 obj_05 obj_10 obj_04 obj_13)
   deleted: (pred_1 obj_10 obj_04) (pred_2 obj_05 obj_13)
   added: (pred_3 obj_05 obj_10 obj_13)
   goals met: 2 of 3
4. (op_2 obj_05 obj_04 obj_08)
   deleted: (pred_4 obj_05 obj_04)
   added: (pred_4 obj_05 obj_08)
   goals met: 2 of 3
5. (op_3 obj_05 obj_10 obj_08 obj_13)
   deleted: (pred_3 obj_05 obj_10 obj_13)
   added: (pred_1 obj_10 obj_08) (pred_2 obj_05 obj_13)
   goals met: 3 of 3
